// 법원별 담당계 매핑
export const COURT_DEPARTMENTS: { [key: string]: string[] } = {
  '서울중앙지방법원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계',
    '경매7계', '경매8계', '경매9계', '경매10계', '경매11계', '경매12계',
    '경매21계', '관리자',
    '경매1계(보존)', '경매2계(보존)', '경매3계(보존)', '경매4계(보존)', 
    '경매5계(보존)', '경매6계(보존)', '경매7계(보존)', '경매8계(보존)', 
    '경매9계(보존)', '경매10계(보존)', '경매11계(보존)', '경매12계(보존)',
    '경매21계(보존)'
  ],
  '서울동부지방법원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계',
    '경매7계', '경매8계', '보존계', '관리자',
    '보존1계(경매1계)', '보존2계(경매2계)', '보존3계', '보존4계', 
    '보존5계', '보존6계', '보존7계'
  ],
  '서울서부지방법원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계',
    '경매7계', '경매8계', '경매3-1계', '관리자'
  ],
  '서울남부지방법원': [
    '경매0계', '경매1계', '경매2계', '경매3계', '경매4계', '경매5계',
    '경매6계', '경매7계', '경매8계', '경매9계', '경매10계', '경매11계',
    '경매12계', '경매13계', '경매14계', '경매15계', '경매16계'
  ],
  '서울북부지방법원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계',
    '경매8계', '경매9계', '경매10계', '경매1-1계',
    '경매2-1계', '경매3-2계', '경매4-2계', '경매5-1계', '보존계'
  ],
  '의정부지방법원': [
    '경매0계', '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계',
    '경매8계', '경매9계', '경매10계', '경매11계',
    '경매12계', '경매13계', '경매14계', '경매15계', '경매16계', '경매17계', '보존(경매)'
  ],
  '고양지원': [
    '경매0계', '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계',
    '경매8계', '경매9계', '경매10계', '경매11계',
    '경매12계', '경매13계', '경매14계', '경매15계', '보존계(경매)'
  ],
  '남양주지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계'
  ],
  '인천지방법원': [
    '경매0계', '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계',
    '경매8계', '경매9계', '경매10계', '경매11계','경매12계','경매13계', '경매14계', '경매15계',
    '경매16계', '경매17계', '경매18계', '경매19계', '경매20계', '경매21계', '경매22계', '경매23계',
    '경매24계', '경매25계', '경매26계', '경매27계', '경매28계', '경매29계', '경매30계', '경매31계',
    '경매41계', '경매42계', '경매1-1계','경매2-1계','경매3-1계','경매4-1계','경매5-1계','경매6-1계',
    '경매7-1계','경매8-1계','경매9-1계','경매10-1계','경매11-1계','경매12-1계','경매13-1계','경매14-1계',
    '경매15-1계','경매16-1계','경매17-1계','경매18-1계','경매19-1계','경매20-1계','경매21-1계','경매22-1계',
    '경매23-1계','경매24-1계','경매25-1계','경매26-1계(보존 등)','경매27-1계','경매28-1계','경매29-1계','경매30-1계',
    '경매31-1계','경매5-2계', '기타집행','기타집행2','기타집행10', '기타집행20', '기타집행30', '기타집행40',
    '경매1계(보존 등)', '경매2계(보존 등)', '경매3계(보존 등)', '경매4계(보존 등)', '경매5계(보존 등)','경매6계(보존 등)', '경매7계(보존 등)',
    '경매8계(보존 등)', '경매9계(보존 등)', '경매10계(보존 등)', '경매11계(보존 등)','경매12계(보존 등)','경매13계(보존 등)', '경매14계(보존 등)', '경매15계(보존 등)',
    '경매16계(보존 등)', '경매17계(보존 등)', '경매18계(보존 등)', '경매19계(보존 등)', '경매20계(보존 등)', '경매21계(보존 등)', '경매22계(보존 등)', '경매23계(보존 등)',
    '경매24계(보존 등)', '경매25계(보존 등)', '경매26계(보존 등)', '경매27계(보존 등)', '경매28계(보존 등)', '경매29계(보존 등)', '경매30계(보존 등)', '경매31계(보존 등)'
  ],
  '부천지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계',
    '경매8계', '경매9계', '경매10계', '경매11계','경매12계'
  ],
  '수원지방법원': [
    '경매0계', '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계',
    '경매8계', '경매9계', '경매10계', '경매11계','경매12계', '경매13계', '경매14계', '경매15계', 
    '경매16계', '경매17계', '경매18계', '경매19계', '경매20계(가)','경매21계','경매20계(나)',
    '경매23계', '보존계'
  ],
  '성남지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계',
    '경매8계', '경매9계'
  ],
  '여주지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계'
  ],
  '평택지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계'
  ],
  '안산지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계',
    '경매8계', '경매9계', '경매10계', '경매11계','경매12계', '경매13계'
  ],
  '안양지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '기타집행33단독'
  ],
  '춘천지방법원': [
    '경매1계', '경매2-1계', '경매4계', '경매2계', '경매3계', '보존2계'
  ],
  '강릉지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계', '경매7계'
  ],
  '원주지원': [
    '경매1계', '경매2계', '경매3계', '경매4계'
  ],
  '속초지원': [
    '경매1계', '경매2계'
  ],
  '영월지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계'
  ],
  '청주지방법원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계', '경매7계', '경매8계'
  ],
  '충주지원': [
    '경매1계', '경매2계', '경매3계', '경매4계'
  ],
  '제천지원': [
    '경매1계', '경매2계'
  ],
  '영동지원': [
    '경매1계', '경매2계'
  ],
  '대전지방법원': [
    '접수', '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계', '경매7계',
    '경매8계', '경매9계', '경매10계', '경매보존계', '경매12계', '경매11계'
  ],
  '홍성지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계', '경매1계(보존)'
  ],
  '논산지원': [
    '경매1계', '경매2계', '경매3계', '경매보존'
  ],
  '천안지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계', '경매7계','경매8계','경매9계'
  ],
  '공주지원': [
    '접수', '경매1계', '경매2계', '경매3계'
  ],
  '서산지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계', '경매7계'
  ],
  '대구지방법원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계', '경매7계', '경매8계', '경매9계',
    '경매10계', '경매11계', '경매12계', '보존1계', '보존2계'
  ],
  '안동지원': [
    '경매1계', '경매2계', '경매3계', '경매4계'
  ],
  '경주지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계'
  ],
  '김천지원': [
    '접수계','경매1계', '경매2계', '경매3계', '경매4계', '경매5계'
  ],
  '상주지원': [
    '경매1계', '경매2계'
  ],
  '의성지원': [
    '경매1계', '경매2계','보존계'
  ],
  '영덕지원': [
    '경매1계', '경매2계'
  ],
  '포항지원': [
    '경매1계', '경매2계','경매3계','경매4계','경매5계'
  ],
  '대구서부지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계', '보존계'
  ],
  '부산지방법원': [
    '접수','경매1계', '경매2계','경매3계', '경매4계', '경매5계', '경매6계','경매7계', '경매8계', '경매9계',
    '경매10계', '경매11계', '경매12계', '경매13계', '경매14계', '경매15계', '경매16계', '경매17', '경매18계', '경매19계', '보존계'
  ],
  '부산동부지원': [
    '경매접수계','경매1계', '경매2계','경매3계', '경매4계', '경매5계', '경매6계','경매7계', '경매8계', '경매9계', '보존계'
  ],
  '부산서부지원': [
    '접수계','경매1계', '경매2계','경매3계', '경매4계', '경매5계', '경매6계','경매7계', '경매보존', '보존계'
  ],
  '울산지방법원': [
    '접수', '경매1계', '경매2계','경매3계', '경매4계', '경매5계', '경매6계','경매7계', '경매8계', '경매9계','보존', '경매10계'
  ],
  '창원지방법원': [
    '접수', '경매1계', '경매2계','경매3계', '경매4계', '경매5계', '경매6계','경매7계', '경매8계', '경매9계', '경매10계', '보존계'
  ],
  '마산지원': [
    '접수', '경매1계', '경매2계','경매3계', '경매4계', '경매5계'
  ],
  '진주지원': [
    '경매1계', '경매2계','경매3계', '경매4계', '경매5계', '경매6계'
  ],
  '통영지원': [
    '접수','경매1계', '경매2계','경매3계', '경매4계', '경매5계', '경매6계','경매7계', '경매8계', '강제집행보존계'
  ],
  '밀양지원': [
    '경매1계','경매2계','경매3계'
  ],
  '거창지원': [
    '경매1계', '경매2계'
  ],
  '광주지방법원': [
    '보존','경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계',
    '경매8계', '경매9계', '경매10계', '경매11계','경매12계','경매13계', '경매14계', '경매15계',
    '경매16계', '경매17계', '경매18계', '경매19계', '경매20계', '경매21계', '경매22계', '경매23계',
    '경매24계', '경매25계', '경매26계', '경매27계'
  ],
  '목포지원': [
    '경매0계', '경매1계', '경매2계','경매3계', '경매4계', '경매5계', '경매6계'
  ],
  '장흥지원': [
    '경매1계', '경매2계'
  ],
  '순천지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계',
    '경매8계', '경매9계', '경매10계', '경매11계','경매12계','경매13계', '경매14계', '경매15계',
    '경매16계', '경매17계', '경매18계', '경매19계'
  ],
  '해남지원': [
    '경매1계', '경매2계','경매3계','경매4계'
  ],
  '전주지방법원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계',
    '경매8계', '경매9계', '경매1-1계(법관)', '경매2-1계(법관)', '경매3-1계(법관)', '경매4-1계(법관)', '경매5-1계(법관)', '경매6-1계(법관)', '경매7-1계(법관)',
    '경매8-1계(법관)', '경매9-1계(법관)'
  ],
  '군산지원': [
    '경매0계', '경매1계', '경매2계', '경매3계', '경매4계', '경매5계', '경매6계', '경매7계', '보존계'
  ],
  '정읍지원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매1계-1(법관)', '경매2계-1(법관)', '경매3계-1(법관)','경매4계-1(법관)'
  ],
  '남원지원': [
    '경매1계', '경매2계'
  ],
  '제주지방법원': [
    '경매1계', '경매2계', '경매3계', '경매4계', '경매5계','경매6계', '경매7계','경매8계','경매9계','보존'
  ]
};

// 법원 목록
export const COURT_LIST = Object.keys(COURT_DEPARTMENTS);

// 특정 법원의 담당계 목록 조회
export const getDepartmentsByCourt = (court: string): string[] => {
  return COURT_DEPARTMENTS[court] || [];
};

